<?php


	$pnamedata = [


		//ทหารบก
		'พลฯ' => 'พลทหาร',
		'พล.อ.' => 'พลเอก',
		'พล.อ.หญิง' => 'พลเอกหญิง',
		'พล.ท.' => 'พลโท',
		'พล.ท.หญิง' => 'พลโทหญิง',
		'พล.ต.' => 'พลตรี',
		'พล.ต.หญิง' => 'พลตรีหญิง',
		'พ.อ.' => 'พันเอก',
		'พ.อ.หญิง' => 'พันเอกหญิง',
		'พ.ท.' => 'พันโท',
		'พ.ท.หญิง' => 'พันโทหญิง',
		'พ.ต.' => 'พันตรี',
		'พ.ต.หญิง' => 'พันตรีหญิง',
		'ร.อ.' => 'ร้อยเอก',
		'ร.อ.หญิง' => 'ร้อยเอกหญิง',
		'ร.ท.' => 'ร้อยโท',
		'ร.ท.หญิง' => 'ร้อยโทหญิง',
		'ร.ต.' => 'ร้อยตรี',
		'ร.ต.หญิง' => 'ร้อยตรีหญิง',
		'จ.ส.อ.' => 'จ่าสิบเอก',
		'จ.ส.อ.หญิง' => 'จ่าสิบเอกหญิง',
		'จ.ส.ท.' => 'จ่าสิบโท',
		'จ.ส.ท.หญิง' => 'จ่าสิบโทหญิง',
		'จ.ส.ต.' => 'จ่าสิบตรี',
		'จ.ส.ต.หญิง' => 'จ่าสิบตรีหญิง',
		'ส.อ.' => 'สิบเอก',
		'ส.อ.หญิง' => 'สิบเอกหญิง',
		'ส.ท.' => 'สิบโท',
		'ส.ท.หญิง' => 'สิบโทหญิง',
		'ส.ต.' => 'สิบตรี',
		'ส.ต.หญิง' => 'สิบตรีหญิง',
    ];