<?php


	$pnamedata = [

		'นรต.' => 'นักเรียนนายร้อยตำรวจ',

		//ตำรวจ
		'พล.ต.อ.' => 'พลตำรวจเอก',
		'พล.ต.อ.หญิง' => 'พลตำรวจเอกหญิง',
		'พล.ต.ท.' => 'พลตำรวจโท',
		'พล.ต.ท.หญิง' => 'พลตำรวจโทหญิง',
		'พล.ต.ต.' => 'พลตำรวจตรี',
		'พล.ต.ต.หญิง' => 'พลตำรวจตรีหญิง',
		'พ.ต.อ.' => 'พันตำรวจเอก',
		'พ.ต.อ.หญิง' => 'พันตำรวจเอกหญิง',
		'พ.ต.ท.' => 'พันตำรวจโท',
		'พ.ต.ท.หญิง' => 'พันตำรวจโทหญิง',
		'พ.ต.ต.' => 'พันตำรวจตรี',
		'พ.ต.ต.หญิง' => 'พันตำรวจตรีหญิง',
		'ร.ต.อ.' => 'ร้อยตำรวจเอก',
		'ร.ต.อ.หญิง' => 'ร้อยตำรวจเอกหญิง',
		'ร.ต.ท.' => 'ร้อยตำรวจโท',
		'ร.ต.ท.หญิง' => 'ร้อยตำรวจโทหญิง',
		'ร.ต.ต.' => 'ร้อยตำรวจตรี',
		'ร.ต.ต.หญิง' => 'ร้อยตำรวจตรีหญิง',
		'ด.ต.' => 'ดาบตำรวจ',
		'ด.ต.หญิง' => 'ดาบตำรวจหญิง',
		'จ.ส.ต.' => 'จ่าสิบตำรวจ',
		'จ.ส.ต.หญิง' => 'จ่าสิบตำรวจหญิง',
		'ส.ต.อ.' => 'สิบตำรวจเอก',
		'ส.ต.อ.หญิง' => 'สิบตำรวจเอกหญิง',
		'ส.ต.ท.หญิง' => 'สิบตำรวจโทหญิง',
		'ส.ต.ต.หญิง' => 'สิบตำรวจโทหญิง',
		'ส.ต.ต.' => 'สิบตำรวจตรี',
		'ส.ต.ท.' => 'สิบตำรวจโท'
    ];